In [1]:
print('hello')

hello

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame([[1,2,3], [2,3,4], [4,5,6]], columns=['A','B','C'], index=['X',"Y","Z"])

In [4]:
df.head()

   A  B  C
X  1  2  3
Y  2  3  4
Z  4  5  6

In [5]:
df.tail(1)

   A  B  C
Z  4  5  6

In [6]:
df.head(3)

   A  B  C
X  1  2  3
Y  2  3  4
Z  4  5  6

In [124]:
df.index.tolist()

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, X to Z
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
dtypes: int64(3)
memory usage: 96.0+ bytes

In [9]:
df.describe()

              A         B         C
count  3.000000  3.000000  3.000000
mean   2.333333  3.333333  4.333333
std    1.527525  1.527525  1.527525
min    1.000000  2.000000  3.000000
25%    1.500000  2.500000  3.500000
50%    2.000000  3.000000  4.000000
75%    3.000000  4.000000  5.000000
max    4.000000  5.000000  6.000000

In [10]:
df.shape

(3, 3)

In [11]:
df["A"].unique()

array([1, 2, 4])

In [12]:
df = pd.read_csv('./coffee.csv')

In [13]:
df_parquet = pd.read_parquet('./results.parquet')

In [14]:
display(df)

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [15]:
df.index.name = None
df = df.reset_index()

In [16]:
df.sample(10)

    index        Day Coffee Type  Units Sold
6       6   Thursday    Espresso          40
5       5  Wednesday       Latte          25
9       9     Friday       Latte          35
11     11   Saturday       Latte          35
2       2    Tuesday    Espresso          30
13     13     Sunday       Latte          35
3       3    Tuesday       Latte          20
7       7   Thursday       Latte          30
12     12     Sunday    Espresso          45
4       4  Wednesday    Espresso          35

In [126]:
df.loc[[0,3]]

       Day Coffee Type  Units Sold
0   Monday    Espresso   25.000000
3  Tuesday       Latte   28.333333

In [18]:
df.loc[:]

    index        Day Coffee Type  Units Sold
0       0     Monday    Espresso          25
1       1     Monday       Latte          15
2       2    Tuesday    Espresso          30
3       3    Tuesday       Latte          20
4       4  Wednesday    Espresso          35
5       5  Wednesday       Latte          25
6       6   Thursday    Espresso          40
7       7   Thursday       Latte          30
8       8     Friday    Espresso          45
9       9     Friday       Latte          35
10     10   Saturday    Espresso          45
11     11   Saturday       Latte          35
12     12     Sunday    Espresso          45
13     13     Sunday       Latte          35

In [19]:
# df.loc["Monday":"Wednesday", "Units Sold"]

In [20]:
df

    index        Day Coffee Type  Units Sold
0       0     Monday    Espresso          25
1       1     Monday       Latte          15
2       2    Tuesday    Espresso          30
3       3    Tuesday       Latte          20
4       4  Wednesday    Espresso          35
5       5  Wednesday       Latte          25
6       6   Thursday    Espresso          40
7       7   Thursday       Latte          30
8       8     Friday    Espresso          45
9       9     Friday       Latte          35
10     10   Saturday    Espresso          45
11     11   Saturday       Latte          35
12     12     Sunday    Espresso          45
13     13     Sunday       Latte          35

In [21]:
df.head()

   index        Day Coffee Type  Units Sold
0      0     Monday    Espresso          25
1      1     Monday       Latte          15
2      2    Tuesday    Espresso          30
3      3    Tuesday       Latte          20
4      4  Wednesday    Espresso          35

In [22]:
df = df.drop(columns=['index'])

In [23]:
df

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [24]:
df.loc[1, "Units Sold"] = 10

In [25]:
df.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          10
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

df.at[0,'Units Sold']

In [127]:
df.iloc[0,0]

'Monday'

In [27]:
df['Day']

0        Monday
1        Monday
2       Tuesday
3       Tuesday
4     Wednesday
5     Wednesday
6      Thursday
7      Thursday
8        Friday
9        Friday
10     Saturday
11     Saturday
12       Sunday
13       Sunday
Name: Day, dtype: object

In [28]:
df.Day

0        Monday
1        Monday
2       Tuesday
3       Tuesday
4     Wednesday
5     Wednesday
6      Thursday
7      Thursday
8        Friday
9        Friday
10     Saturday
11     Saturday
12       Sunday
13       Sunday
Name: Day, dtype: object

In [29]:
df.sort_values('Units Sold', ascending=False)

          Day Coffee Type  Units Sold
10   Saturday    Espresso          45
8      Friday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
4   Wednesday    Espresso          35
11   Saturday       Latte          35
13     Sunday       Latte          35
9      Friday       Latte          35
2     Tuesday    Espresso          30
7    Thursday       Latte          30
0      Monday    Espresso          25
5   Wednesday       Latte          25
3     Tuesday       Latte          20
1      Monday       Latte          10

In [30]:
df.sort_values(['Units Sold','Coffee Type'], ascending=False)

          Day Coffee Type  Units Sold
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
4   Wednesday    Espresso          35
7    Thursday       Latte          30
2     Tuesday    Espresso          30
5   Wednesday       Latte          25
0      Monday    Espresso          25
3     Tuesday       Latte          20
1      Monday       Latte          10

In [31]:
df.sort_values(['Units Sold','Coffee Type'], ascending=[0,1])

          Day Coffee Type  Units Sold
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
4   Wednesday    Espresso          35
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
2     Tuesday    Espresso          30
7    Thursday       Latte          30
0      Monday    Espresso          25
5   Wednesday       Latte          25
3     Tuesday       Latte          20
1      Monday       Latte          10

In [32]:
for x,y in df.iterrows():
    print(x)
    print(y['Units Sold'])
    print('\n\n')

0
25



1
10



2
30



3
20



4
35



5
25



6
40



7
30



8
45



9
35



10
45



11
35



12
45



13
35

In [33]:
df.loc[df['Units Sold']>15]

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [129]:
df.loc[df['Units Sold']>15, ['Day']]

          Day
0      Monday
2     Tuesday
3     Tuesday
4   Wednesday
5   Wednesday
6    Thursday
7    Thursday
8      Friday
9      Friday
10   Saturday
11   Saturday
12     Sunday
13     Sunday

In [130]:
df.loc[df['Units Sold']>15 & (df['Day']=='Monday')]

          Day Coffee Type  Units Sold
0      Monday    Espresso   25.000000
1      Monday       Latte   15.000000
2     Tuesday    Espresso   21.666667
3     Tuesday       Latte   28.333333
4   Wednesday    Espresso   35.000000
5   Wednesday       Latte   25.000000
6    Thursday    Espresso   40.000000
7    Thursday       Latte   30.000000
8      Friday    Espresso   45.000000
9      Friday       Latte   35.000000
10   Saturday    Espresso   45.000000
11   Saturday       Latte   35.000000
12     Sunday    Espresso   45.000000
13     Sunday       Latte   35.000000

In [36]:
df[df['Day'].str.contains('Monday')]

      Day Coffee Type  Units Sold
0  Monday    Espresso          25
1  Monday       Latte          10

In [37]:
df[df['Day'].str.contains('monday|Wednesday',case=False)]

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          10
4  Wednesday    Espresso          35
5  Wednesday       Latte          25

In [38]:
df[df['Day'].isin(['Monday','Wednesday','Friday']) & (df['Units Sold']>20)]

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
4  Wednesday    Espresso          35
5  Wednesday       Latte          25
8     Friday    Espresso          45
9     Friday       Latte          35

In [39]:
df.query('Day=="Monday"')

      Day Coffee Type  Units Sold
0  Monday    Espresso          25
1  Monday       Latte          10

In [40]:
df['Day'] = 'Monday'

In [41]:
df

       Day Coffee Type  Units Sold
0   Monday    Espresso          25
1   Monday       Latte          10
2   Monday    Espresso          30
3   Monday       Latte          20
4   Monday    Espresso          35
5   Monday       Latte          25
6   Monday    Espresso          40
7   Monday       Latte          30
8   Monday    Espresso          45
9   Monday       Latte          35
10  Monday    Espresso          45
11  Monday       Latte          35
12  Monday    Espresso          45
13  Monday       Latte          35

In [42]:
df = pd.read_csv('./coffee.csv')

In [43]:
df['Price']=4.99

In [44]:
import numpy as np
df['New_Price'] = np.where(df['Coffee Type']== 'Espresso', 3.99, 4.99)

In [45]:
df.drop(0)

          Day Coffee Type  Units Sold  Price  New_Price
1      Monday       Latte          15   4.99       4.99
2     Tuesday    Espresso          30   4.99       3.99
3     Tuesday       Latte          20   4.99       4.99
4   Wednesday    Espresso          35   4.99       3.99
5   Wednesday       Latte          25   4.99       4.99
6    Thursday    Espresso          40   4.99       3.99
7    Thursday       Latte          30   4.99       4.99
8      Friday    Espresso          45   4.99       3.99
9      Friday       Latte          35   4.99       4.99
10   Saturday    Espresso          45   4.99       3.99
11   Saturday       Latte          35   4.99       4.99
12     Sunday    Espresso          45   4.99       3.99
13     Sunday       Latte          35   4.99       4.99

In [46]:
df

          Day Coffee Type  Units Sold  Price  New_Price
0      Monday    Espresso          25   4.99       3.99
1      Monday       Latte          15   4.99       4.99
2     Tuesday    Espresso          30   4.99       3.99
3     Tuesday       Latte          20   4.99       4.99
4   Wednesday    Espresso          35   4.99       3.99
5   Wednesday       Latte          25   4.99       4.99
6    Thursday    Espresso          40   4.99       3.99
7    Thursday       Latte          30   4.99       4.99
8      Friday    Espresso          45   4.99       3.99
9      Friday       Latte          35   4.99       4.99
10   Saturday    Espresso          45   4.99       3.99
11   Saturday       Latte          35   4.99       4.99
12     Sunday    Espresso          45   4.99       3.99
13     Sunday       Latte          35   4.99       4.99

In [47]:
df.drop(columns=['New_Price'])

          Day Coffee Type  Units Sold  Price
0      Monday    Espresso          25   4.99
1      Monday       Latte          15   4.99
2     Tuesday    Espresso          30   4.99
3     Tuesday       Latte          20   4.99
4   Wednesday    Espresso          35   4.99
5   Wednesday       Latte          25   4.99
6    Thursday    Espresso          40   4.99
7    Thursday       Latte          30   4.99
8      Friday    Espresso          45   4.99
9      Friday       Latte          35   4.99
10   Saturday    Espresso          45   4.99
11   Saturday       Latte          35   4.99
12     Sunday    Espresso          45   4.99
13     Sunday       Latte          35   4.99

In [48]:
df

          Day Coffee Type  Units Sold  Price  New_Price
0      Monday    Espresso          25   4.99       3.99
1      Monday       Latte          15   4.99       4.99
2     Tuesday    Espresso          30   4.99       3.99
3     Tuesday       Latte          20   4.99       4.99
4   Wednesday    Espresso          35   4.99       3.99
5   Wednesday       Latte          25   4.99       4.99
6    Thursday    Espresso          40   4.99       3.99
7    Thursday       Latte          30   4.99       4.99
8      Friday    Espresso          45   4.99       3.99
9      Friday       Latte          35   4.99       4.99
10   Saturday    Espresso          45   4.99       3.99
11   Saturday       Latte          35   4.99       4.99
12     Sunday    Espresso          45   4.99       3.99
13     Sunday       Latte          35   4.99       4.99

In [49]:
df.drop(columns=['New_Price'], inplace=True)

In [50]:
df

          Day Coffee Type  Units Sold  Price
0      Monday    Espresso          25   4.99
1      Monday       Latte          15   4.99
2     Tuesday    Espresso          30   4.99
3     Tuesday       Latte          20   4.99
4   Wednesday    Espresso          35   4.99
5   Wednesday       Latte          25   4.99
6    Thursday    Espresso          40   4.99
7    Thursday       Latte          30   4.99
8      Friday    Espresso          45   4.99
9      Friday       Latte          35   4.99
10   Saturday    Espresso          45   4.99
11   Saturday       Latte          35   4.99
12     Sunday    Espresso          45   4.99
13     Sunday       Latte          35   4.99

In [51]:
df_new = df.copy()
df_new['Price'] = 5.0

In [52]:
df

          Day Coffee Type  Units Sold  Price
0      Monday    Espresso          25   4.99
1      Monday       Latte          15   4.99
2     Tuesday    Espresso          30   4.99
3     Tuesday       Latte          20   4.99
4   Wednesday    Espresso          35   4.99
5   Wednesday       Latte          25   4.99
6    Thursday    Espresso          40   4.99
7    Thursday       Latte          30   4.99
8      Friday    Espresso          45   4.99
9      Friday       Latte          35   4.99
10   Saturday    Espresso          45   4.99
11   Saturday       Latte          35   4.99
12     Sunday    Espresso          45   4.99
13     Sunday       Latte          35   4.99

In [53]:
df_new

          Day Coffee Type  Units Sold  Price
0      Monday    Espresso          25    5.0
1      Monday       Latte          15    5.0
2     Tuesday    Espresso          30    5.0
3     Tuesday       Latte          20    5.0
4   Wednesday    Espresso          35    5.0
5   Wednesday       Latte          25    5.0
6    Thursday    Espresso          40    5.0
7    Thursday       Latte          30    5.0
8      Friday    Espresso          45    5.0
9      Friday       Latte          35    5.0
10   Saturday    Espresso          45    5.0
11   Saturday       Latte          35    5.0
12     Sunday    Espresso          45    5.0
13     Sunday       Latte          35    5.0

In [54]:
df = df[['Day', 'Coffee Type', 'Units Sold']]

In [55]:
df

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [131]:
df['Price'] = 5
df['revenue'] = df['Units Sold'] * df['Price']

In [57]:
df

          Day Coffee Type  Units Sold  Price  revenue
0      Monday    Espresso          25      5      125
1      Monday       Latte          15      5       75
2     Tuesday    Espresso          30      5      150
3     Tuesday       Latte          20      5      100
4   Wednesday    Espresso          35      5      175
5   Wednesday       Latte          25      5      125
6    Thursday    Espresso          40      5      200
7    Thursday       Latte          30      5      150
8      Friday    Espresso          45      5      225
9      Friday       Latte          35      5      175
10   Saturday    Espresso          45      5      225
11   Saturday       Latte          35      5      175
12     Sunday    Espresso          45      5      225
13     Sunday       Latte          35      5      175

In [58]:
df.rename(columns={'{Price':'Coffee_price'}, inplace=True)

In [59]:
df

          Day Coffee Type  Units Sold  Price  revenue
0      Monday    Espresso          25      5      125
1      Monday       Latte          15      5       75
2     Tuesday    Espresso          30      5      150
3     Tuesday       Latte          20      5      100
4   Wednesday    Espresso          35      5      175
5   Wednesday       Latte          25      5      125
6    Thursday    Espresso          40      5      200
7    Thursday       Latte          30      5      150
8      Friday    Espresso          45      5      225
9      Friday       Latte          35      5      175
10   Saturday    Espresso          45      5      225
11   Saturday       Latte          35      5      175
12     Sunday    Espresso          45      5      225
13     Sunday       Latte          35      5      175

In [60]:
df = pd.read_csv('./coffee.csv')

In [61]:
bios = pd.read_csv('./bios.csv')

In [62]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [63]:
bios_new = bios.copy()
bios_new['first_name'] = bios_new['name'].str.split(' ').str[0]

In [64]:
bios_new.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-Franois
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert

In [65]:
bios_new.query('first_name=="Keith"')

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name
1897,1907,Keith Hanlon,1966-09-01,NaN,NaN,NaN,Ireland,NaN,NaN,NaN,Keith
3505,3517,Keith Wallace,1961-03-29,Preston,England,GBR,Great Britain,165.0,51.0,1999-12-31,Keith
6228,6255,Keith Hartley,1940-10-15,Vancouver,British Columbia,CAN,Canada,200.0,85.0,NaN,Keith
8898,8946,Keith Mwila,1966-01-01,NaN,NaN,NaN,Zambia,NaN,NaN,1993-01-09,Keith
12053,12118,Keith Hervey,1898-11-03,Fulham,England,GBR,Great Britain,NaN,NaN,1973-02-22,Keith
...,...,...,...,...,...,...,...,...,...,...,...
99921,100722,Keith Carney,1970-02-03,Providence,Rhode Island,USA,United States,188.0,93.0,NaN,Keith
102227,103168,Keith Beavers,1983-02-09,London,Ontario,CAN,Canada,185.0,75.0,NaN,Keith
109900,111105,Keith Cumberpatch,1927-08-25,Christchurch,Canterbury,NZL,New Zealand,NaN,NaN,2013-11-15,Keith
115973,117348,Keith Sanderson,1975-02-02,Plymouth,Massachusetts,USA,United States,183.0,95.0,NaN,Keith
122121,124176,Keith Ferguson,1979-09-07,Sale,Victoria,AUS,Australia,176.0,78.0,NaN,Keith

In [66]:
bios.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   athlete_id    145500 non-null  int64
 1   name          145500 non-null  object
 2   born_date     143693 non-null  object
 3   born_city     110908 non-null  object
 4   born_region   110908 non-null  object
 5   born_country  110908 non-null  object
 6   NOC           145499 non-null  object
 7   height_cm     106651 non-null  float64
 8   weight_kg     102070 non-null  float64
 9   died_date     33940 non-null   object
dtypes: float64(2), int64(1), object(7)
memory usage: 11.1+ MB

In [67]:
bios_new['born_datetime'] = pd.to_datetime(bios['born_date'], format='%Y-%m-%d')

In [68]:
bios_new['born_year'] = bios_new['born_datetime'].dt.year
bios_new[['name', 'born_year']]

                         name  born_year
0       Jean-Franois Blanchy     1886.0
1              Arnaud Boetsch     1969.0
2                Jean Borotra     1898.0
3             Jacques Brugnon     1895.0
4                Albert Canet     1878.0
...                       ...        ...
145495      Polina Luchnikova     2002.0
145496    Valeriya Merkusheva     1999.0
145497        Yuliya Smirnova     1998.0
145498         Andr Foussard     1899.0
145499          Bill Phillips     1913.0

[145500 rows x 2 columns]

In [69]:
bios_new.to_csv('./bios_new.csv', index=False)

In [70]:
bios['heigt_category'] = bios['height_cm'].apply(lambda x: 'Short' if x <165 else ('Average' if x <185 else 'Taller'))

In [71]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,heigt_category
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Taller
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Average
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Average
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Average
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Taller

In [72]:
def categorize_athelete(row):
    if row['height_cm'] < 175 and row['weight_kg'] < 70:
        return 'LightWeight'
    elif row['height_cm'] < 185 and row['weight_kg'] <= 80:
        return 'Middleweight'
    else:
        "Heavyweight"
bios['category'] = bios.apply(categorize_athelete, axis =1)

In [73]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,heigt_category,category
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Taller,None
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Average,Middleweight
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Average,Middleweight
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Average,LightWeight
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Taller,None

In [74]:
nocs = pd.read_csv('./noc_regions.csv')

In [75]:
nocs.head()

   NOC       region                 notes
0  AFG  Afghanistan                   NaN
1  AHO      Curacao  Netherlands Antilles
2  ALB      Albania                   NaN
3  ALG      Algeria                   NaN
4  AND      Andorra                   NaN

In [76]:
bios_new = pd.merge(bios, nocs, left_on='born_country', right_on='NOC', how='left')

In [77]:
bios_new.rename(columns={'born_country':'born_country_full'}, inplace=True)

In [78]:
bios_new.head()

,athlete_id,name,born_date,born_city,born_region,born_country_full,NOC_x,height_cm,weight_kg,died_date,heigt_category,category,NOC_y,region,notes
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Taller,None,FRA,France,NaN
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Average,Middleweight,FRA,France,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Average,Middleweight,FRA,France,NaN
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Average,LightWeight,FRA,France,NaN
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Taller,None,GBR,UK,NaN

In [79]:
usa = bios[bios['born_country']=='USA'].copy()
gbr = bios[bios['born_country']=='GBR'].copy()

In [80]:
gbr.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,heigt_category,category
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Taller,None
37,38,Helen Aitchison,1881-12-06,Sunderland,England,GBR,Great Britain,NaN,NaN,1947-05-26,Taller,None
38,39,Geraldine Beamish,1883-06-23,Forest Gate,England,GBR,Great Britain,NaN,NaN,1972-05-10,Taller,None
39,40,Dora Boothby,1881-08-02,Finchley,England,GBR,Great Britain,NaN,NaN,1970-02-22,Taller,None
40,41,Julie Bradbury,1967-02-12,Oxford,England,GBR,Great Britain,175.0,64.0,NaN,Average,Middleweight

In [81]:
new_df = pd.concat([usa,gbr])

In [82]:
new_df.tail()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,heigt_category,category
144811,148512,Benjamin Alexander,1983-05-08,London,England,GBR,Jamaica,NaN,NaN,NaN,Taller,None
144815,148517,Ashley Watson,1993-10-28,Peterborough,England,GBR,Jamaica,NaN,NaN,NaN,Taller,None
145005,148716,Peder Kongshaug,2001-08-13,Wimbledon,England,GBR,Norway,184.0,86.0,NaN,Average,None
145319,149041,Axel Brown,1992-04-02,Harrogate,England,GBR,Trinidad and Tobago,NaN,NaN,NaN,Taller,None
145388,149111,Jean-Luc Baker,1993-10-07,Burnley,England,GBR,United States,NaN,NaN,NaN,Taller,None

In [83]:
#Handling Null Values

In [84]:
df.loc[[2,3], 'Units Sold'] = np.nan

In [85]:
df

          Day Coffee Type  Units Sold
0      Monday    Espresso        25.0
1      Monday       Latte        15.0
2     Tuesday    Espresso         NaN
3     Tuesday       Latte         NaN
4   Wednesday    Espresso        35.0
5   Wednesday       Latte        25.0
6    Thursday    Espresso        40.0
7    Thursday       Latte        30.0
8      Friday    Espresso        45.0
9      Friday       Latte        35.0
10   Saturday    Espresso        45.0
11   Saturday       Latte        35.0
12     Sunday    Espresso        45.0
13     Sunday       Latte        35.0

In [86]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Day          14 non-null     object
 1   Coffee Type  14 non-null     object
 2   Units Sold   12 non-null     float64
dtypes: float64(1), object(2)
memory usage: 468.0+ bytes

In [87]:
df.fillna(df['Units Sold'].mean())

          Day Coffee Type  Units Sold
0      Monday    Espresso   25.000000
1      Monday       Latte   15.000000
2     Tuesday    Espresso   34.166667
3     Tuesday       Latte   34.166667
4   Wednesday    Espresso   35.000000
5   Wednesday       Latte   25.000000
6    Thursday    Espresso   40.000000
7    Thursday       Latte   30.000000
8      Friday    Espresso   45.000000
9      Friday       Latte   35.000000
10   Saturday    Espresso   45.000000
11   Saturday       Latte   35.000000
12     Sunday    Espresso   45.000000
13     Sunday       Latte   35.000000

In [88]:
df.fillna(df['Units Sold'].interpolate)

          Day Coffee Type                                         Units Sold
0      Monday    Espresso                                               25.0
1      Monday       Latte                                               15.0
2     Tuesday    Espresso  <bound method NDFrame.interpolate of 0     25....
3     Tuesday       Latte  <bound method NDFrame.interpolate of 0     25....
4   Wednesday    Espresso                                               35.0
5   Wednesday       Latte                                               25.0
6    Thursday    Espresso                                               40.0
7    Thursday       Latte                                               30.0
8      Friday    Espresso                                               45.0
9      Friday       Latte                                               35.0
10   Saturday    Espresso                                               45.0
11   Saturday       Latte                                               35.0
12     Sunday    Espresso                                               45.0
13     Sunday       Latte                                               35.0

In [89]:
df.loc[[2,3], 'Units Sold'] = np.nan

In [90]:
df

          Day Coffee Type  Units Sold
0      Monday    Espresso        25.0
1      Monday       Latte        15.0
2     Tuesday    Espresso         NaN
3     Tuesday       Latte         NaN
4   Wednesday    Espresso        35.0
5   Wednesday       Latte        25.0
6    Thursday    Espresso        40.0
7    Thursday       Latte        30.0
8      Friday    Espresso        45.0
9      Friday       Latte        35.0
10   Saturday    Espresso        45.0
11   Saturday       Latte        35.0
12     Sunday    Espresso        45.0
13     Sunday       Latte        35.0

In [91]:
df['Units Sold'].interpolate()

0     25.000000
1     15.000000
2     21.666667
3     28.333333
4     35.000000
5     25.000000
6     40.000000
7     30.000000
8     45.000000
9     35.000000
10    45.000000
11    35.000000
12    45.000000
13    35.000000
Name: Units Sold, dtype: float64

In [92]:
df['Units Sold'] = df['Units Sold'].interpolate()

In [93]:
df.dropna(subset=['Units Sold'], inplace=True)

In [94]:
df

          Day Coffee Type  Units Sold
0      Monday    Espresso   25.000000
1      Monday       Latte   15.000000
2     Tuesday    Espresso   21.666667
3     Tuesday       Latte   28.333333
4   Wednesday    Espresso   35.000000
5   Wednesday       Latte   25.000000
6    Thursday    Espresso   40.000000
7    Thursday       Latte   30.000000
8      Friday    Espresso   45.000000
9      Friday       Latte   35.000000
10   Saturday    Espresso   45.000000
11   Saturday       Latte   35.000000
12     Sunday    Espresso   45.000000
13     Sunday       Latte   35.000000

In [95]:
df[df['Units Sold'].isna()]

Empty DataFrame
Columns: [Day, Coffee Type, Units Sold]
Index: []

In [96]:
df[df['Units Sold'].notna()]

          Day Coffee Type  Units Sold
0      Monday    Espresso   25.000000
1      Monday       Latte   15.000000
2     Tuesday    Espresso   21.666667
3     Tuesday       Latte   28.333333
4   Wednesday    Espresso   35.000000
5   Wednesday       Latte   25.000000
6    Thursday    Espresso   40.000000
7    Thursday       Latte   30.000000
8      Friday    Espresso   45.000000
9      Friday       Latte   35.000000
10   Saturday    Espresso   45.000000
11   Saturday       Latte   35.000000
12     Sunday    Espresso   45.000000
13     Sunday       Latte   35.000000

In [97]:
#Aggregating Data

In [98]:
bios['born_city'].value_counts()

born_city
Budapest            1378
Moskva (Moscow)      883
Oslo                 708
Stockholm            629
Praha (Prague)       600
                    ...
Roth                   1
Romoos                 1
Dva Polya Artash       1
Dulwich Hill           1
Vis                   1
Name: count, Length: 22368, dtype: int64

In [99]:
bios[bios['born_country']=='USA']['born_region'].value_counts().tail()

born_region
South Dakota     27
West Virginia    24
Delaware         22
North Dakota     16
Wyoming          14
Name: count, dtype: int64

In [100]:
df['Units Sold'] = df['Units Sold'].interpolate()

In [101]:
df

          Day Coffee Type  Units Sold
0      Monday    Espresso   25.000000
1      Monday       Latte   15.000000
2     Tuesday    Espresso   21.666667
3     Tuesday       Latte   28.333333
4   Wednesday    Espresso   35.000000
5   Wednesday       Latte   25.000000
6    Thursday    Espresso   40.000000
7    Thursday       Latte   30.000000
8      Friday    Espresso   45.000000
9      Friday       Latte   35.000000
10   Saturday    Espresso   45.000000
11   Saturday       Latte   35.000000
12     Sunday    Espresso   45.000000
13     Sunday       Latte   35.000000

In [102]:
df.groupby('Coffee Type')['Units Sold'].sum()

Coffee Type
Espresso    256.666667
Latte       203.333333
Name: Units Sold, dtype: float64

In [103]:
df.groupby('Coffee Type')['Units Sold'].mean()

Coffee Type
Espresso    36.666667
Latte       29.047619
Name: Units Sold, dtype: float64

In [104]:
df.groupby(['Coffee Type', 'Day']).agg({'Units Sold':'sum'})

                       Units Sold
Coffee Type Day
Espresso    Friday      45.000000
            Monday      25.000000
            Saturday    45.000000
            Sunday      45.000000
            Thursday    40.000000
            Tuesday     21.666667
            Wednesday   35.000000
Latte       Friday      35.000000
            Monday      15.000000
            Saturday    35.000000
            Sunday      35.000000
            Thursday    30.000000
            Tuesday     28.333333
            Wednesday   25.000000

In [105]:
pivot = df.pivot(index='Day', columns='Coffee Type', values='Units Sold')

In [106]:
pivot

Coffee Type   Espresso      Latte
Day
Friday       45.000000  35.000000
Monday       25.000000  15.000000
Saturday     45.000000  35.000000
Sunday       45.000000  35.000000
Thursday     40.000000  30.000000
Tuesday      21.666667  28.333333
Wednesday    35.000000  25.000000

In [107]:
pivot.sum(axis=0)

Coffee Type
Espresso    256.666667
Latte       203.333333
dtype: float64

In [108]:
bios['born_date'] = pd.to_datetime(bios['born_date'])
bios['month_born'] = bios['born_date'].dt.month
bios['year'] = bios['born_date'].dt.year
bios.groupby([bios['year'],bios['month_born']])['name'].count().reset_index().sort_values('name', ascending=False)

        year  month_born  name
1437  1970.0         1.0   239
1461  1972.0         1.0   229
1629  1986.0         1.0   227
1497  1975.0         1.0   227
1617  1985.0         1.0   225
...      ...         ...   ...
51    1852.0         5.0     1
52    1852.0         6.0     1
1882  2008.0         7.0     1
1883  2008.0         8.0     1
1884  2009.0         1.0     1

[1885 rows x 3 columns]

In [109]:
coffee = pd.read_csv('./coffee.csv')

In [110]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [111]:
coffee['yesterday_revenue'] = coffee['Units Sold'].shift(1)

In [112]:
coffee

          Day Coffee Type  Units Sold  yesterday_revenue
0      Monday    Espresso          25                NaN
1      Monday       Latte          15               25.0
2     Tuesday    Espresso          30               15.0
3     Tuesday       Latte          20               30.0
4   Wednesday    Espresso          35               20.0
5   Wednesday       Latte          25               35.0
6    Thursday    Espresso          40               25.0
7    Thursday       Latte          30               40.0
8      Friday    Espresso          45               30.0
9      Friday       Latte          35               45.0
10   Saturday    Espresso          45               35.0
11   Saturday       Latte          35               45.0
12     Sunday    Espresso          45               35.0
13     Sunday       Latte          35               45.0

In [113]:
coffee['pct_change'] =coffee['Units Sold']/coffee['yesterday_revenue'] * 100

In [114]:
coffee

          Day Coffee Type  Units Sold  yesterday_revenue  pct_change
0      Monday    Espresso          25                NaN         NaN
1      Monday       Latte          15               25.0   60.000000
2     Tuesday    Espresso          30               15.0  200.000000
3     Tuesday       Latte          20               30.0   66.666667
4   Wednesday    Espresso          35               20.0  175.000000
5   Wednesday       Latte          25               35.0   71.428571
6    Thursday    Espresso          40               25.0  160.000000
7    Thursday       Latte          30               40.0   75.000000
8      Friday    Espresso          45               30.0  150.000000
9      Friday       Latte          35               45.0   77.777778
10   Saturday    Espresso          45               35.0  128.571429
11   Saturday       Latte          35               45.0   77.777778
12     Sunday    Espresso          45               35.0  128.571429
13     Sunday       Latte          35               45.0   77.777778

In [115]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,heigt_category,category,month_born,year
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Taller,None,12.0,1886.0
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Average,Middleweight,4.0,1969.0
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Average,Middleweight,8.0,1898.0
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Average,LightWeight,5.0,1895.0
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Taller,None,4.0,1878.0

In [116]:
bios['height_rank'] = bios['height_cm'].rank(ascending=False)

In [117]:
bios.sort_values(['height_rank'], ascending=False)

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,heigt_category,category,month_born,year,height_rank
4515,4530,Lyton Mphande,1963-05-14,NaN,NaN,NaN,Malawi,127.0,62.0,NaN,Short,LightWeight,5.0,1963.0,106650.5
28619,28832,Rosario Briones,1953-10-05,San Luis Potos,San Luis Potos,MEX,Mexico,127.0,42.0,NaN,Short,LightWeight,10.0,1953.0,106650.5
4516,4531,Helman Palije,1967-06-24,NaN,NaN,NaN,Malawi,128.0,74.0,NaN,Short,Middleweight,6.0,1967.0,106649.0
4517,4532,Boston Simbeye,1959-12-24,NaN,NaN,NaN,Malawi,130.0,67.0,NaN,Short,LightWeight,12.0,1959.0,106647.5
4664,4681,Salvador Miranda,1949-09-13,NaN,NaN,NaN,Nicaragua,130.0,51.0,NaN,Short,LightWeight,9.0,1949.0,106647.5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
145490,149217,Sin Ye-Chan,1995-06-13,NaN,NaN,NaN,Republic of Korea,NaN,NaN,NaN,Taller,None,6.0,1995.0,NaN
145491,149218,Matthew Wepke,1989-12-05,NaN,NaN,NaN,Jamaica,NaN,NaN,NaN,Taller,None,12.0,1989.0,NaN
145492,149219,Carlos Garca-Ordez,1927-04-24,La Habana (Havana),Ciudad de La Habana,CUB,Cuba,NaN,NaN,2019-11-24,Taller,None,4.0,1927.0,NaN
145493,149220,Landysh Falyakhova,1998-08-31,Dva Polya Artash,Respublika Tatarstan,RUS,ROC,NaN,NaN,NaN,Taller,None,8.0,1998.0,NaN
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,Taller,None,7.0,1913.0,NaN

In [118]:
bios.sort_values(['height_rank']).sample(10)[['name', 'height_rank']]

                      name  height_rank
118311         Don Mecklem          NaN
39033         Ryszard Gio      27597.5
14002    Angelo De Martini          NaN
64216          Mike Harvey      58380.5
85587   Ferdinand Grssing          NaN
50689          Nina Harmar      66080.0
99441      Hitoshi Uematsu      96305.5
94576     Stanislav Medik      38677.0
144892          Kim Eun-Ji          NaN
61717        Giorgio Gorla      46966.0

In [119]:
coffee.select_dtypes('float').cumsum().reset_index()

    index  yesterday_revenue   pct_change
0       0                NaN          NaN
1       1               25.0    60.000000
2       2               40.0   260.000000
3       3               70.0   326.666667
4       4               90.0   501.666667
5       5              125.0   573.095238
6       6              150.0   733.095238
7       7              190.0   808.095238
8       8              220.0   958.095238
9       9              265.0  1035.873016
10     10              300.0  1164.444444
11     11              345.0  1242.222222
12     12              380.0  1370.793651
13     13              425.0  1448.571429

In [120]:
coffee['cumulative_sum'] = coffee['Units Sold'].cumsum()

In [121]:
coffee

,Day,Coffee Type,Units Sold,yesterday_revenue,pct_change,cumulative_sum
0,Monday,Espresso,25,NaN,NaN,25
1,Monday,Latte,15,25.0,60.000000,40
2,Tuesday,Espresso,30,15.0,200.000000,70
3,Tuesday,Latte,20,30.0,66.666667,90
4,Wednesday,Espresso,35,20.0,175.000000,125
5,Wednesday,Latte,25,35.0,71.428571,150
6,Thursday,Espresso,40,25.0,160.000000,190
7,Thursday,Latte,30,40.0,75.000000,220
8,Friday,Espresso,45,30.0,150.000000,265
9,Friday,Latte,35,45.0,77.777778,300
10,Saturday,Espresso,45,35.0,128.571429,345
11,Saturday,Latte,35,45.0,77.777778,380
12,Sunday,Espresso,45,35.0,128.571429,425
13,Sunday,Latte,35,45.0,77.777778,460

In [122]:
latte = coffee[coffee['Coffee Type']=='Latte'].copy()
latte['3day'] = latte['Units Sold'].rolling(3).sum()

In [123]:
latte

,Day,Coffee Type,Units Sold,yesterday_revenue,pct_change,cumulative_sum,3day
1,Monday,Latte,15,25.0,60.000000,40,NaN
3,Tuesday,Latte,20,30.0,66.666667,90,NaN
5,Wednesday,Latte,25,35.0,71.428571,150,60.0
7,Thursday,Latte,30,40.0,75.000000,220,75.0
9,Friday,Latte,35,45.0,77.777778,300,90.0
11,Saturday,Latte,35,45.0,77.777778,380,100.0
13,Sunday,Latte,35,45.0,77.777778,460,105.0